In [158]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [159]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"
db = create_engine(db_string)

connection_sqlalchemy = db.connect()

Zad.1

In [160]:
df = pd.read_sql('select distinct category from film_list',con = connection)
print(df)

       category
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/4091494413.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('select distinct category from film_list',con = connection)

Zad.2

In [161]:
print(df.sort_values('category'))

       category
14       Action
5     Animation
15     Children
1      Classics
4        Comedy
12  Documentary
8         Drama
3        Family
13      Foreign
11        Games
9        Horror
7         Music
2           New
10       Sci-Fi
0        Sports
6        Travel

Zad.3

In [162]:
df = pd.read_sql_query('select release_year from film',con = connection)
print(df.min())
print(df.max())

release_year    2006
dtype: int64
release_year    2006
dtype: int64

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/751730774.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('select release_year from film',con = connection)

Zad.4

In [163]:
df = pd.read_sql_query("select rental_date from rental where rental_date between '2005-07-01 00:00:00'::timestamp and '2005-08-01 23:59:59'::timestamp",con=connection)
print(df.count())

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/3396594656.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("select rental_date from rental where rental_date between '2005-07-01 00:00:00'::timestamp and '2005-08-01 23:59:59'::timestamp",con=connection)

rental_date    7380
dtype: int64

Zad.5

In [164]:
df = pd.read_sql("select rental_date from rental where rental_date between '2010-01-01 00:00:00'::timestamp and '2011-02-01 23:59:59'::timestamp",con=connection)
print(df.count())

rental_date    0
dtype: int64

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/3507627606.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select rental_date from rental where rental_date between '2010-01-01 00:00:00'::timestamp and '2011-02-01 23:59:59'::timestamp",con=connection)

Zad.6

In [165]:
df = pd.read_sql("select max(amount) from payment",con=connection)
df

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/316241399.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select max(amount) from payment",con=connection)

     max
0  11.99

Zad.7

In [166]:
df = pd.read_sql("select * from customer_list where country = 'Poland' or country = 'Nigeria' or country = 'Bangladesh'",con=connection)
df

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/2058367716.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select * from customer_list where country = 'Poland' or country = 'Nigeria' or country = 'Bangladesh'",con=connection)

,id,name,address,zip code,phone,city,country,notes,sid
0,284,Sonia Gregory,1279 Udine Parkway,75860,195003555232,Benin City,Nigeria,active,1
1,318,Brian Wyman,1769 Iwaki Lane,25787,556100547674,Bydgoszcz,Poland,active,1
2,572,Sidney Burleson,1405 Hagonoy Avenue,86587,867287719310,Czestochowa,Poland,active,1
3,409,Rodney Moeller,1936 Lapu-Lapu Parkway,7122,653436985797,Deba Habe,Nigeria,active,2
4,332,Stephen Qualls,1838 Tabriz Lane,1195,38988715447,Dhaka,Bangladesh,active,1
5,286,Velma Lucas,1155 Liaocheng Place,22650,558236142492,Effon-Alaiye,Nigeria,active,1
6,80,Marilyn Ross,1888 Kabul Drive,20936,701457319790,Ife,Nigeria,active,1
7,198,Elsie Kelley,955 Bamenda Way,1545,768481779568,Ikerre,Nigeria,active,2
8,103,Gladys Hamilton,1177 Jelets Way,3305,484292626944,Ilorin,Nigeria,active,1
9,329,Frank Waggoner,1816 Bydgoszcz Loop,64308,965273813662,Jamalpur,Bangladesh,active,2
10,128,Marjorie Tucker,1050 Garden Grove Avenue,4999,973047364353,Jastrzebie-Zdrj,Poland,active,1
11,18,Carol Garcia,320 Brest Avenue,43331,747791594069,Kaduna,Nigeria,active,2
12,270,Leah Curtis,906 Goinia Way,83565,701767622697,Kalisz,Poland,active,1
13,501,Ruben Geary,414 Mandaluyong Street,16370,52709222667,Lublin,Poland,active,1
14,277,Olga Jimenez,556 Baybay Manor,55802,363982224739,Ogbomosho,Nigeria,active,2
15,156,Bertha Ferguson,1367 Yantai Manor,21294,889538496300,Ondo,Nigeria,active,1
16,280,Tracey Barrett,1006 Santa Brbara dOeste Manor,36229,85059738746,Owo,Nigeria,active,2
17,250,Jo Fowler,786 Stara Zagora Way,98332,716256596301,Oyo,Nigeria,active,2
18,571,Johnnie Chisholm,1501 Pangkal Pinang Avenue,943,770864062795,Plock,Poland,active,2
19,562,Wallace Slone,1342 Sharja Way,93655,946114054231,Sokoto,Nigeria,active,1
20,21,Michelle Clark,262 A Corua (La Corua) Parkway,34418,892775750063,Tangail,Bangladesh,active,1
21,380,Russell Brinson,1642 Charlotte Amalie Drive,75442,821476736117,Tychy,Poland,active,1
22,558,Jimmie Eggleston,505 Madiun Boulevard,97271,970638808606,Wroclaw,Poland,active,1
23,232,Constance Reid,885 Yingkou Manor,31390,588964509072,Zaria,Nigeria,active,2

Zad.8

In [167]:
df = pd.read_sql("select country from staff_list",con=connection)
df

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/3057657904.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select country from staff_list",con=connection)

     country
0     Canada
1  Australia

Zad.9

In [168]:
df = pd.read_sql("select count(*) from staff_list where country = 'Argentina' or country = 'Spain'",con=connection)
df

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/3323438462.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select count(*) from staff_list where country = 'Argentina' or country = 'Spain'",con=connection)

   count
0      0

Zad.10

In [169]:
df = pd.read_sql("select name from category",con = connection)
df

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/4126701810.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select name from category",con = connection)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Zad.11

In [170]:
df = pd.read_sql("select name from category where category_id in (select category_id from film_category where film_id in (select film_id from inventory where inventory_id in (select inventory_id from rental where customer_id in(select id from customer_list where country = 'United States')))) order by name ASC",con = connection)
df

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/2467974162.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select name from category where category_id in (select category_id from film_category where film_id in (select film_id from inventory where inventory_id in (select inventory_id from rental where customer_id in(select id from customer_list where country = 'United States')))) order by name ASC",con = connection)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Zad 12

In [171]:
df = pd.read_sql("select distinct title from film where film_id in (select film_id from film_actor where actor_id in (select actor_id from actor where (last_name = 'Pfeiffer' and first_name = 'Olympia') or (last_name = 'Zellweger' and first_name = 'Julia') or (last_name = 'Presley' and first_name = 'Ellen')))",con = connection)
df

C:\Users\pacio\AppData\Local\Temp/ipykernel_18960/3072809920.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("select distinct title from film where film_id in (select film_id from film_actor where actor_id in (select actor_id from actor where (last_name = 'Pfeiffer' and first_name = 'Olympia') or (last_name = 'Zellweger' and first_name = 'Julia') or (last_name = 'Presley' and first_name = 'Ellen')))",con = connection)

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]